
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'h25e62c96f8182fcc': html`
          <span>الآلي 
          <sl-badge variant="success">يقبل
          </sl-badge> الكلمة 
          <b>${0}</b>.
          </span>
        `,
'h28031e78bb7297a9': html`
          <span>الآلي 
          <sl-badge variant="danger">يرفض
          </sl-badge> الكلمة 
          <b>${0}</b>.
          </span>
        `,
'h2e7f32ac617924d0': html`الانتقال المفقود لـ 
          <b>${0}</b>
        `,
'h5130af20b6d54f05': html`انتقالات متعددة لـ 
          <b>${0}</b>
        `,
'h56d667fd1fb9d47d': html`يرجى إصلاح الأخطاء التالية 
          <sl-badge variant="danger">الأخطاء
          </sl-badge> لتشغيل المحاكاة:
        `,
'h6c2fe3d409d7ba36': html`لم يتم العثور على مسار صحيح. الآلي 
          <sl-badge variant="danger">يرفض
          </sl-badge> الكلمة 
          <b>${0}</b>.
        `,
's033b7cf13e11023b': `التحولات:`,
's05c44a5db696fcaf': `التحرير`,
's061cc20e3432dead': `وقفة`,
's09243007b5b91006': `إذا كان`,
's09318db807188948': `إضافة Sinkstate`,
's09c6c5bc21d0e1f0': `لتحرير عقدة انقر بزر الماوس الأيمن فوق العقدة`,
's0fbf6dc6a1966408': `التالي`,
's11b075d3731a5194': `إضافة عقدة (Ctrl+Q)`,
's1b00cf75d5f4f616': `اختر خطوة:`,
's1b5a859826f8be7d': `مطول`,
's1c2404542b3e48d9': `التحولات`,
's21b06c38fc4164db': `متقدم`,
's255857544a9d5ec0': `إعادة تعيين`,
's261af1b4598fef3f': `الأوضاع المسموح بها`,
's2ea31ea953b32ee5': `الانتقال برمز فارغ`,
's2f64461723d3df5d': `التغيير`,
's3050764b15c8baf0': `إظهار جدول التحولات`,
's335050fdf97d8f6e': `لا توجد حالة أولية محددة`,
's337a1e9022a8d19f': `الجدول`,
's352719d86112de9a': `المساعدة`,
's35f1dd3fd023476a': `الأتمتة`,
's36494e700fe1e5c6': `خطوة بخطوة`,
's36dfd719c2d7c63c': `الاتحاد الوطني للأغذية والزراعة`,
's3c0d17bad169557b': `لا شيء`,
's3de7bee91528e5cc': `إجراءات المكدس`,
's3e141c08e0ace321': `لغة الاختبار`,
's42b6431842b835b3': `اللغة:`,
's42cbd8dca939a9c7': `تحقق`,
's4b10acae683d2978': `ملء الشاشة`,
's4f6476c3d1856c19': `لا توجد خطوات أخرى ممكنة. جرّب مساراً مختلفاً.`,
's5590dbf7e425789d': `التسمية`,
's568f5722bc79d077': `سينكستيت`,
's5787e20cab57b383': `خطأ غير معروف`,
's61f0ff0bab2b8310': `تحريك`,
's64ef2a6c2dd1d3d1': `تحرير`,
's6503256c2de2745c': `إيدج`,
's66bd1cc6d2f6b68d': `العقدة`,
's66da3efd9a45b25a': `شيك فارغ`,
's6a7a6503441d48ee': `لتعديل انتقال ما انقر بزر الماوس الأيمن فوق الانتقال`,
's6c80030e2762459d': `ادفع`,
's6d8c02aee480af7a': `القائمة`,
's6ea31a50ccf59dcf': `إضافة حافة (Ctrl+E)`,
's71813a5a8d63ac81': `كلمة الإدخال`,
's74a96f52fd23c3e8': `حالات أولية متعددة محددة`,
's779b5819564f2f50': `البوب`,
's78bc8524e7c2d052': `المغسلة`,
's7b72a2e6d7ff3291': `نقل العناصر عن طريق السحب والإفلات`,
's7df224ba56fb8e1e': `مفتاح تبديل الوضع`,
's7f59f507e02a2f38': `عرض`,
's860b83fc8a41ca5c': `أنواع الأتمتة`,
's8d5ca919f3cad950': `المساعد الرقمي الشخصي`,
's8da37819f40688b0': `البوب`,
's8e3f9c3e183abbda': `الحروف الأبجدية المحددة مسبقاً`,
's8f1034e1a9d93097': `النهائي`,
's904fefb3d01cb2ae': `فارغة`,
's9274cd474969c49c': `تبديل الوضع (Ctrl+M)`,
's956c5a9fb7ee0b23': `يدوي`,
's970d041a28d1067d': `ادفع`,
's9d8b8aa2b404c2c8': `الإعدادات`,
's9f4a96e81b296478': `إضافة انتقال بالسحب والإفلات`,
'sa0a141a796a5b36a': `الانحناء`,
'sa3c972a6b05ed840': `الحالة الأولية:`,
'sa4088b649da557a5': `شيك آلي`,
'sa82cf626cfa888ac': `ضوابط المحاكاة`,
'saa415adf36e8d84f': `الدول النهائية:`,
'saad05eab0e59411c': `كلمة الإدخال على سبيل المثال aaababb، خطوة؛ خطوة؛ توقف`,
'sae4f7c13b7ec18ff': `المكدس`,
'sb508f35111b54817': `عرض المساعدة`,
'sb80ac0a010cbc647': `نوع الآلي`,
'sba6693303903d6b8': `إضافة رمز`,
'sc1611c0558728a2a': `المنصب`,
'sc16e00a7a8b2fde2': `رجوع`,
'sc725a41694d85bb0': `حالات الاختبار`,
'scbb4cdb4d52edc80': `كلمات الاختبار`,
'scd105819b5a10243': `اللعب`,
'scfcffcf35292bc6f': `محاكاة`,
'sd083d3aa96af5af1': `الرمز`,
'sd2223afb7d6b100d': `النوع`,
'sd341bbdc948e6521': `إضافة عقدة بالنقر فوق`,
'sd60a7dde73859828': `احتفظ`,
'sd9ad53251f2330a5': `توقف`,
'sdc673e73b5c13aea': `حذف`,
'se033711991bc46ea': `DFA`,
'se6a414abec96883f': `الدول:`,
'se9d940b50ed4b85f': `نمط ملصق المساعد الرقمي الشخصي الرقمي`,
'sea4f20ea1ece70a0': `التعريف`,
'sed72ab193dd16a0a': `توقفت المحاكاة مؤقتاً.`,
'sf62fea3229bf87c8': `إظهار التعريف الرسمي`,
'sf9aee319a006c9b4': `إضافة`,
'sfb68cae41d749423': `مبدئي`,
'sfc3c36b69e4ef120': `الحروف الأبجدية`,
    };
  