
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'h25e62c96f8182fcc': html`
          <span>Автоматът 
          <sl-badge variant="success">приема
          </sl-badge> думата 
          <b>${0}</b>.
          </span>
        `,
'h28031e78bb7297a9': html`
          <span>Автоматът 
          <sl-badge variant="danger">отхвърля
          </sl-badge> думата 
          <b>${0}</b>.
          </span>
        `,
'h2e7f32ac617924d0': html`Липсващ преход за 
          <b>${0}</b>
        `,
'h5130af20b6d54f05': html`Множество преходи за 
          <b>${0}</b>
        `,
'h56d667fd1fb9d47d': html`Моля, поправете следното 
          <sl-badge variant="danger">грешки
          </sl-badge> за да стартирате симулацията:
        `,
'h6c2fe3d409d7ba36': html`Не е намерен валиден път. Автоматът 
          <sl-badge variant="danger">отхвърля
          </sl-badge> думата 
          <b>${0}</b>.
        `,
's033b7cf13e11023b': `Преходи:`,
's05c44a5db696fcaf': `Редактиране на`,
's061cc20e3432dead': `Пауза`,
's09243007b5b91006': `Ако`,
's09318db807188948': `Добавяне на Sinkstate`,
's09c6c5bc21d0e1f0': `За да редактирате възел, щракнете с десния бутон върху него.`,
's0fbf6dc6a1966408': `Следваща`,
's11b075d3731a5194': `Добавяне на възел (Ctrl+Q)`,
's1b00cf75d5f4f616': `Изберете ход:`,
's1b5a859826f8be7d': `Върбова информация`,
's1c2404542b3e48d9': `Трансформации`,
's21b06c38fc4164db': `Разширен`,
's255857544a9d5ec0': `Нулиране на`,
's261af1b4598fef3f': `Разрешени режими`,
's2ea31ea953b32ee5': `Преход с празен символ`,
's2f64461723d3df5d': `Промяна`,
's3050764b15c8baf0': `Показване на таблицата за преходи`,
's335050fdf97d8f6e': `Не е дефинирано начално състояние`,
's337a1e9022a8d19f': `Таблица`,
's352719d86112de9a': `Помощ`,
's35f1dd3fd023476a': `Автоматизация`,
's36494e700fe1e5c6': `Стъпка по стъпка`,
's36dfd719c2d7c63c': `NFA`,
's3c0d17bad169557b': `няма`,
's3de7bee91528e5cc': `Действия на стека`,
's3e141c08e0ace321': `Език на теста`,
's42b6431842b835b3': `Език:`,
's42cbd8dca939a9c7': `Проверете`,
's4b10acae683d2978': `Пълен екран`,
's4f6476c3d1856c19': `Не са възможни по-нататъшни движения. Опитайте да изберете друг път.`,
's5590dbf7e425789d': `Етикет`,
's568f5722bc79d077': `Sinkstate`,
's5787e20cab57b383': `Неизвестна грешка`,
's61f0ff0bab2b8310': `Анимация`,
's64ef2a6c2dd1d3d1': `Редактиране на`,
's6503256c2de2745c': `Edge`,
's66bd1cc6d2f6b68d': `Възел`,
's66da3efd9a45b25a': `Проверка за празнота`,
's6a7a6503441d48ee': `За да редактирате преход, щракнете с десния бутон върху прехода`,
's6c80030e2762459d': `натиснете`,
's6d8c02aee480af7a': `Меню`,
's6ea31a50ccf59dcf': `Добавяне на ръб (Ctrl+E)`,
's71813a5a8d63ac81': `Входна дума`,
's74a96f52fd23c3e8': `Дефиниране на множество начални състояния`,
's779b5819564f2f50': `поп`,
's78bc8524e7c2d052': `Мивка`,
's7b72a2e6d7ff3291': `Преместване на елементите чрез плъзгане и пускане`,
's7df224ba56fb8e1e': `Превключвател на режима`,
's7f59f507e02a2f38': `Вижте`,
's860b83fc8a41ca5c': `Видове автомати`,
's8d5ca919f3cad950': `PDA`,
's8da37819f40688b0': `Поп`,
's8e3f9c3e183abbda': `Предварително зададена азбука`,
's8f1034e1a9d93097': `Окончателен`,
's904fefb3d01cb2ae': `празен`,
's9274cd474969c49c': `Превключване на режима (Ctrl+M)`,
's956c5a9fb7ee0b23': `Ръководство`,
's970d041a28d1067d': `Push`,
's9d8b8aa2b404c2c8': `Настройки`,
's9f4a96e81b296478': `Добавяне на преход чрез плъзгане и пускане`,
'sa0a141a796a5b36a': `Bend`,
'sa3c972a6b05ed840': `Първоначално състояние:`,
'sa4088b649da557a5': `Проверка на автомат`,
'sa82cf626cfa888ac': `Контроли на симулацията`,
'saa415adf36e8d84f': `Крайни държави:`,
'saad05eab0e59411c': `Входна дума, напр. aaabbb, step;step;stop`,
'sae4f7c13b7ec18ff': `Стек`,
'sb508f35111b54817': `Показване на помощ`,
'sb80ac0a010cbc647': `Тип автомат`,
'sba6693303903d6b8': `Добавяне на символ`,
'sc1611c0558728a2a': `Позиция`,
'sc16e00a7a8b2fde2': `Обратно`,
'sc725a41694d85bb0': `Тестови случаи`,
'scbb4cdb4d52edc80': `Тестови думи`,
'scd105819b5a10243': `Играйте`,
'scfcffcf35292bc6f': `Симулирайте`,
'sd083d3aa96af5af1': `Символ`,
'sd2223afb7d6b100d': `Тип`,
'sd341bbdc948e6521': `Добавяне на възел чрез кликване`,
'sd60a7dde73859828': `Запазете`,
'sd9ad53251f2330a5': `Спрете`,
'sdc673e73b5c13aea': `Изтриване на`,
'se033711991bc46ea': `DFA`,
'se6a414abec96883f': `Щати:`,
'se9d940b50ed4b85f': `Стил на етикета на PDA`,
'sea4f20ea1ece70a0': `Определение`,
'sed72ab193dd16a0a': `Симулацията направи пауза.`,
'sf62fea3229bf87c8': `Показване на формално определение`,
'sf9aee319a006c9b4': `Добавяне на`,
'sfb68cae41d749423': `Първоначален`,
'sfc3c36b69e4ef120': `Азбука:`,
    };
  