
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'h25e62c96f8182fcc': html`
          <span>Το αυτόματο 
          <sl-badge variant="success">δέχεται
          </sl-badge> τη λέξη 
          <b>${0}</b>.
          </span>
        `,
'h28031e78bb7297a9': html`
          <span>Το αυτόματο 
          <sl-badge variant="danger">απορρίπτει το
          </sl-badge> τη λέξη 
          <b>${0}</b>.
          </span>
        `,
'h2e7f32ac617924d0': html`Λείπει η μετάβαση για 
          <b>${0}</b>
        `,
'h5130af20b6d54f05': html`Πολλαπλές μεταβάσεις για 
          <b>${0}</b>
        `,
'h56d667fd1fb9d47d': html`Παρακαλώ διορθώστε τα ακόλουθα 
          <sl-badge variant="danger">σφάλματα
          </sl-badge> για να εκτελέσετε την προσομοίωση:
        `,
'h6c2fe3d409d7ba36': html`Δεν βρέθηκε έγκυρη διαδρομή. Το αυτόματο 
          <sl-badge variant="danger">απορρίπτει το
          </sl-badge> τη λέξη 
          <b>${0}</b>.
        `,
's033b7cf13e11023b': `Μεταβάσεις:`,
's05c44a5db696fcaf': `Επεξεργασία`,
's061cc20e3432dead': `Παύση`,
's09243007b5b91006': `Εάν`,
's09318db807188948': `Προσθέστε Sinkstate`,
's09c6c5bc21d0e1f0': `Για να επεξεργαστείτε έναν κόμβο κάντε δεξί κλικ στον κόμβο`,
's0fbf6dc6a1966408': `Επόμενο`,
's11b075d3731a5194': `Προσθήκη κόμβου (Ctrl+Q)`,
's1b00cf75d5f4f616': `Επιλέξτε μια κίνηση:`,
's1b5a859826f8be7d': `Λεκτικός`,
's1c2404542b3e48d9': `Μετασχηματισμοί`,
's21b06c38fc4164db': `Προχωρημένο`,
's255857544a9d5ec0': `Επαναφορά`,
's261af1b4598fef3f': `Επιτρεπόμενες λειτουργίες`,
's2ea31ea953b32ee5': `Μετάβαση με κενό σύμβολο`,
's2f64461723d3df5d': `Αλλαγή`,
's3050764b15c8baf0': `Εμφάνιση πίνακα μεταβάσεων`,
's335050fdf97d8f6e': `Δεν ορίζεται αρχική κατάσταση`,
's337a1e9022a8d19f': `Πίνακας`,
's352719d86112de9a': `Βοήθεια`,
's35f1dd3fd023476a': `Αυτοματισμός`,
's36494e700fe1e5c6': `Βήμα προς βήμα`,
's36dfd719c2d7c63c': `NFA`,
's3c0d17bad169557b': `κανένας`,
's3de7bee91528e5cc': `Ενέργειες στοίβας`,
's3e141c08e0ace321': `Γλώσσα δοκιμής`,
's42b6431842b835b3': `Γλώσσα:`,
's42cbd8dca939a9c7': `Ελέγξτε το`,
's4b10acae683d2978': `Πλήρης οθόνη`,
's4f6476c3d1856c19': `Δεν είναι δυνατόν να γίνουν άλλες κινήσεις. Δοκιμάστε ένα διαφορετικό μονοπάτι.`,
's5590dbf7e425789d': `Ετικέτα`,
's568f5722bc79d077': `Sinkstate`,
's5787e20cab57b383': `Άγνωστο σφάλμα`,
's61f0ff0bab2b8310': `Animate`,
's64ef2a6c2dd1d3d1': `Επεξεργασία`,
's6503256c2de2745c': `Άκρη`,
's66bd1cc6d2f6b68d': `Κόμβος`,
's66da3efd9a45b25a': `Κενό Έλεγχος`,
's6a7a6503441d48ee': `Για να επεξεργαστείτε μια μετάβαση κάντε δεξί κλικ στη μετάβαση`,
's6c80030e2762459d': `push`,
's6d8c02aee480af7a': `Μενού`,
's6ea31a50ccf59dcf': `Προσθήκη άκρης (Ctrl+E)`,
's71813a5a8d63ac81': `Λέξη εισόδου`,
's74a96f52fd23c3e8': `Ορισμός πολλαπλών αρχικών καταστάσεων`,
's779b5819564f2f50': `pop`,
's78bc8524e7c2d052': `Νεροχύτης`,
's7b72a2e6d7ff3291': `Μετακινήστε τα στοιχεία με σύρσιμο και απόθεση`,
's7df224ba56fb8e1e': `Διακόπτης λειτουργίας`,
's7f59f507e02a2f38': `Προβολή`,
's860b83fc8a41ca5c': `Τύποι αυτομάτων`,
's8d5ca919f3cad950': `PDA`,
's8da37819f40688b0': `Pop`,
's8e3f9c3e183abbda': `Προκαθορισμένο αλφάβητο`,
's8f1034e1a9d93097': `Τελικό`,
's904fefb3d01cb2ae': `άδειο`,
's9274cd474969c49c': `Αλλαγή λειτουργίας (Ctrl+M)`,
's956c5a9fb7ee0b23': `Χειροκίνητο`,
's970d041a28d1067d': `Σπρώξτε το`,
's9d8b8aa2b404c2c8': `Ρυθμίσεις`,
's9f4a96e81b296478': `Προσθήκη μετάβασης με drag and drop`,
'sa0a141a796a5b36a': `Bend`,
'sa3c972a6b05ed840': `Αρχική κατάσταση:`,
'sa4088b649da557a5': `Έλεγχος αυτοματισμού`,
'sa82cf626cfa888ac': `Έλεγχοι προσομοίωσης`,
'saa415adf36e8d84f': `Τελικές Πολιτείες:`,
'saad05eab0e59411c': `Input Word π.χ. aaabbb, step;step;stop`,
'sae4f7c13b7ec18ff': `Στοίβα`,
'sb508f35111b54817': `Εμφάνιση βοήθειας`,
'sb80ac0a010cbc647': `Τύπος αυτοματισμού`,
'sba6693303903d6b8': `Προσθήκη συμβόλου`,
'sc1611c0558728a2a': `Θέση`,
'sc16e00a7a8b2fde2': `Πίσω`,
'sc725a41694d85bb0': `Περιπτώσεις δοκιμής`,
'scbb4cdb4d52edc80': `Λέξεις δοκιμής`,
'scd105819b5a10243': `Παίξτε`,
'scfcffcf35292bc6f': `Προσομοίωση`,
'sd083d3aa96af5af1': `Σύμβολο`,
'sd2223afb7d6b100d': `Τύπος`,
'sd341bbdc948e6521': `Προσθήκη κόμβου με κλικ`,
'sd60a7dde73859828': `Κρατήστε το`,
'sd9ad53251f2330a5': `Σταματήστε το`,
'sdc673e73b5c13aea': `Διαγραφή`,
'se033711991bc46ea': `DFA`,
'se6a414abec96883f': `Πολιτείες:`,
'se9d940b50ed4b85f': `Στυλ ετικέτας PDA`,
'sea4f20ea1ece70a0': `Ορισμός`,
'sed72ab193dd16a0a': `Η προσομοίωση σταμάτησε.`,
'sf62fea3229bf87c8': `Εμφάνιση επίσημου ορισμού`,
'sf9aee319a006c9b4': `Προσθέστε`,
'sfb68cae41d749423': `Αρχικό`,
'sfc3c36b69e4ef120': `Αλφάβητο:`,
    };
  