
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'h25e62c96f8182fcc': html`
          <span>Автомат 
          <sl-badge variant="success">принимает
          </sl-badge> слово 
          <b>${0}</b>.
          </span>
        `,
'h28031e78bb7297a9': html`
          <span>Автомат 
          <sl-badge variant="danger">отвергает
          </sl-badge> слово 
          <b>${0}</b>.
          </span>
        `,
'h2e7f32ac617924d0': html`Отсутствующий переход для 
          <b>${0}</b>
        `,
'h5130af20b6d54f05': html`Несколько переходов для 
          <b>${0}</b>
        `,
'h56d667fd1fb9d47d': html`Пожалуйста, исправьте следующие 
          <sl-badge variant="danger">ошибки
          </sl-badge> чтобы запустить симуляцию:
        `,
'h6c2fe3d409d7ba36': html`Не найден правильный путь. Автомат 
          <sl-badge variant="danger">отвергает
          </sl-badge> слово 
          <b>${0}</b>.
        `,
's033b7cf13e11023b': `Переходы:`,
's05c44a5db696fcaf': `Редактирование`,
's061cc20e3432dead': `Пауза`,
's09243007b5b91006': `Если`,
's09318db807188948': `Добавить государство Синкстейт`,
's09c6c5bc21d0e1f0': `Чтобы отредактировать узел, щелкните его правой кнопкой мыши.`,
's0fbf6dc6a1966408': `Следующий`,
's11b075d3731a5194': `Добавить узел (Ctrl+Q)`,
's1b00cf75d5f4f616': `Выберите ход:`,
's1b5a859826f8be7d': `Verbose`,
's1c2404542b3e48d9': `Трансформации`,
's21b06c38fc4164db': `Расширенный`,
's255857544a9d5ec0': `Сброс`,
's261af1b4598fef3f': `Разрешенные режимы`,
's2ea31ea953b32ee5': `Переход с пустым символом`,
's2f64461723d3df5d': `Изменить`,
's3050764b15c8baf0': `Показать таблицу переходов`,
's335050fdf97d8f6e': `Начальное состояние не определено`,
's337a1e9022a8d19f': `Таблица`,
's352719d86112de9a': `Помощь`,
's35f1dd3fd023476a': `Автоматизация`,
's36494e700fe1e5c6': `Шаг за шагом`,
's36dfd719c2d7c63c': `NFA`,
's3c0d17bad169557b': `нет`,
's3de7bee91528e5cc': `Действия стека`,
's3e141c08e0ace321': `Язык тестов`,
's42b6431842b835b3': `Язык:`,
's42cbd8dca939a9c7': `Проверьте`,
's4b10acae683d2978': `Полный экран`,
's4f6476c3d1856c19': `Дальнейшее движение невозможно. Попробуйте другой путь.`,
's5590dbf7e425789d': `Этикетка`,
's568f5722bc79d077': `Sinkstate`,
's5787e20cab57b383': `Неизвестная ошибка`,
's61f0ff0bab2b8310': `Анимация`,
's64ef2a6c2dd1d3d1': `Редактировать`,
's6503256c2de2745c': `Край`,
's66bd1cc6d2f6b68d': `Узел`,
's66da3efd9a45b25a': `Пустая проверка`,
's6a7a6503441d48ee': `Чтобы отредактировать переход, щелкните его правой кнопкой мыши.`,
's6c80030e2762459d': `нажмите`,
's6d8c02aee480af7a': `Меню`,
's6ea31a50ccf59dcf': `Добавить край (Ctrl+E)`,
's71813a5a8d63ac81': `Входное слово`,
's74a96f52fd23c3e8': `Определено несколько начальных состояний`,
's779b5819564f2f50': `поп`,
's78bc8524e7c2d052': `Раковина`,
's7b72a2e6d7ff3291': `Перемещайте элементы с помощью перетаскивания`,
's7df224ba56fb8e1e': `Переключатель режимов`,
's7f59f507e02a2f38': `Посмотреть`,
's860b83fc8a41ca5c': `Типы автоматов`,
's8d5ca919f3cad950': `КПК`,
's8da37819f40688b0': `Поп`,
's8e3f9c3e183abbda': `Предопределенный алфавит`,
's8f1034e1a9d93097': `Финал`,
's904fefb3d01cb2ae': `пустой`,
's9274cd474969c49c': `Переключение режима (Ctrl+M)`,
's956c5a9fb7ee0b23': `Руководство`,
's970d041a28d1067d': `Нажмите`,
's9d8b8aa2b404c2c8': `Настройки`,
's9f4a96e81b296478': `Добавьте переход с помощью перетаскивания`,
'sa0a141a796a5b36a': `Изгиб`,
'sa3c972a6b05ed840': `Начальное состояние:`,
'sa4088b649da557a5': `Проверочный автомат`,
'sa82cf626cfa888ac': `Управление моделированием`,
'saa415adf36e8d84f': `Последние штаты:`,
'saad05eab0e59411c': `Входное слово, например, aaabbb, step;step;stop`,
'sae4f7c13b7ec18ff': `Стек`,
'sb508f35111b54817': `Показать помощь`,
'sb80ac0a010cbc647': `Тип автомата`,
'sba6693303903d6b8': `Добавить символ`,
'sc1611c0558728a2a': `Позиция`,
'sc16e00a7a8b2fde2': `Назад`,
'sc725a41694d85bb0': `Тестовые примеры`,
'scbb4cdb4d52edc80': `Проверочные слова`,
'scd105819b5a10243': `Играть`,
'scfcffcf35292bc6f': `Имитация`,
'sd083d3aa96af5af1': `Символ`,
'sd2223afb7d6b100d': `Тип`,
'sd341bbdc948e6521': `Добавьте узел щелчком мыши`,
'sd60a7dde73859828': `Сохраняйте`,
'sd9ad53251f2330a5': `Остановить`,
'sdc673e73b5c13aea': `Удалить`,
'se033711991bc46ea': `DFA`,
'se6a414abec96883f': `Штаты:`,
'se9d940b50ed4b85f': `Стиль этикетки КПК`,
'sea4f20ea1ece70a0': `Определение`,
'sed72ab193dd16a0a': `Симуляция сделала паузу.`,
'sf62fea3229bf87c8': `Показать формальное определение`,
'sf9aee319a006c9b4': `Добавить`,
'sfb68cae41d749423': `Первоначальный`,
'sfc3c36b69e4ef120': `Алфавит:`,
    };
  