
    // Do not modify this file by hand!
    // Re-generate this file by running lit-localize

    import {html} from 'lit';
    

    /* eslint-disable no-irregular-whitespace */
    /* eslint-disable @typescript-eslint/no-explicit-any */

    export const templates = {
      'h25e62c96f8182fcc': html`
          <span>Автомат 
          <sl-badge variant="success">приймає
          </sl-badge> слово 
          <b>${0}</b>.
          </span>
        `,
'h28031e78bb7297a9': html`
          <span>Автомат 
          <sl-badge variant="danger">відкидає
          </sl-badge> слово 
          <b>${0}</b>.
          </span>
        `,
'h2e7f32ac617924d0': html`Відсутній перехід для 
          <b>${0}</b>
        `,
'h5130af20b6d54f05': html`Кілька переходів для 
          <b>${0}</b>
        `,
'h56d667fd1fb9d47d': html`Будь ласка, виправте наступні 
          <sl-badge variant="danger">помилки
          </sl-badge> для запуску симуляції:
        `,
'h6c2fe3d409d7ba36': html`Не знайдено правильного шляху. Автомат 
          <sl-badge variant="danger">відкидає
          </sl-badge> слово 
          <b>${0}</b>.
        `,
's033b7cf13e11023b': `Переходи:`,
's05c44a5db696fcaf': `Редагування`,
's061cc20e3432dead': `Пауза.`,
's09243007b5b91006': `Якщо`,
's09318db807188948': `Додати Sinkstate`,
's09c6c5bc21d0e1f0': `Щоб відредагувати вузол, клацніть його правою кнопкою миші`,
's0fbf6dc6a1966408': `Далі`,
's11b075d3731a5194': `Додати вузол (Ctrl+Q)`,
's1b00cf75d5f4f616': `Обирай хід:`,
's1b5a859826f8be7d': `Багатослівний`,
's1c2404542b3e48d9': `Трансформації`,
's21b06c38fc4164db': `Розширений`,
's255857544a9d5ec0': `Перезавантаження`,
's261af1b4598fef3f': `Дозволені режими`,
's2ea31ea953b32ee5': `Перехід з порожнім символом`,
's2f64461723d3df5d': `Зміна`,
's3050764b15c8baf0': `Показати таблицю переходів`,
's335050fdf97d8f6e': `Початковий стан не визначено`,
's337a1e9022a8d19f': `Таблиця`,
's352719d86112de9a': `Допоможіть!`,
's35f1dd3fd023476a': `Автоматизація`,
's36494e700fe1e5c6': `Крок за кроком`,
's36dfd719c2d7c63c': `NFA`,
's3c0d17bad169557b': `ні`,
's3de7bee91528e5cc': `Стекові дії`,
's3e141c08e0ace321': `Мова тестування`,
's42b6431842b835b3': `Мова:`,
's42cbd8dca939a9c7': `Перевірка.`,
's4b10acae683d2978': `Повноекранний режим`,
's4f6476c3d1856c19': `Подальші кроки неможливі. Спробуйте інший шлях.`,
's5590dbf7e425789d': `Етикетка`,
's568f5722bc79d077': `Стан раковини`,
's5787e20cab57b383': `Невідома помилка`,
's61f0ff0bab2b8310': `Анімація`,
's64ef2a6c2dd1d3d1': `Редагувати`,
's6503256c2de2745c': `Край`,
's66bd1cc6d2f6b68d': `Вузол`,
's66da3efd9a45b25a': `Порожній чек`,
's6a7a6503441d48ee': `Щоб відредагувати перехід, клацніть правою кнопкою миші на переході`,
's6c80030e2762459d': `поштовх`,
's6d8c02aee480af7a': `Меню`,
's6ea31a50ccf59dcf': `Додати край (Ctrl+E)`,
's71813a5a8d63ac81': `Вхідне слово`,
's74a96f52fd23c3e8': `Визначено декілька початкових станів`,
's779b5819564f2f50': `хлопок`,
's78bc8524e7c2d052': `Раковина`,
's7b72a2e6d7ff3291': `Переміщення елементів за допомогою перетягування`,
's7df224ba56fb8e1e': `Перемикач режимів`,
's7f59f507e02a2f38': `Вигляд`,
's860b83fc8a41ca5c': `Типи автоматів`,
's8d5ca919f3cad950': `КПК`,
's8da37819f40688b0': `Поп`,
's8e3f9c3e183abbda': `Заздалегідь визначений алфавіт`,
's8f1034e1a9d93097': `Фінал`,
's904fefb3d01cb2ae': `порожньо`,
's9274cd474969c49c': `Перемикання режиму (Ctrl+M)`,
's956c5a9fb7ee0b23': `Посібник`,
's970d041a28d1067d': `Штовхни.`,
's9d8b8aa2b404c2c8': `Налаштування`,
's9f4a96e81b296478': `Додавання переходу перетягуванням`,
'sa0a141a796a5b36a': `Нахиляйся.`,
'sa3c972a6b05ed840': `Початковий стан:`,
'sa4088b649da557a5': `Чек-автомат`,
'sa82cf626cfa888ac': `Керування симуляцією`,
'saa415adf36e8d84f': `Кінцеві стани:`,
'saad05eab0e59411c': `Вхідне слово, наприклад, aaabbb, step;step;stop`,
'sae4f7c13b7ec18ff': `Стек`,
'sb508f35111b54817': `Показати довідку`,
'sb80ac0a010cbc647': `Тип автомата`,
'sba6693303903d6b8': `Додати символ`,
'sc1611c0558728a2a': `Посада`,
'sc16e00a7a8b2fde2': `Назад`,
'sc725a41694d85bb0': `Тестові кейси`,
'scbb4cdb4d52edc80': `Тестові слова`,
'scd105819b5a10243': `Грай.`,
'scfcffcf35292bc6f': `Імітувати`,
'sd083d3aa96af5af1': `Символ`,
'sd2223afb7d6b100d': `Тип`,
'sd341bbdc948e6521': `Додайте вузол натисканням кнопки`,
'sd60a7dde73859828': `Тримай`,
'sd9ad53251f2330a5': `Стоп!`,
'sdc673e73b5c13aea': `Видалити`,
'se033711991bc46ea': `DFA`,
'se6a414abec96883f': `Штати:`,
'se9d940b50ed4b85f': `Стиль етикетки для КПК`,
'sea4f20ea1ece70a0': `Визначення`,
'sed72ab193dd16a0a': `Симуляція призупинилася.`,
'sf62fea3229bf87c8': `Показати формальне визначення`,
'sf9aee319a006c9b4': `Додати`,
'sfb68cae41d749423': `Ініціал`,
'sfc3c36b69e4ef120': `Алфавіт:`,
    };
  